## File I/O , DataFrame Generation

In [16]:
import pandas as pd
import numpy as np

prices = pd.read_csv('temp/p01_prices.txt', index_col=0, parse_dates=[0])
volumes = pd.read_csv('temp/p01_volumes.txt', index_col=0, parse_dates=[0])

In [17]:
prices

                  AAPL        GOOG         JNJ        XOM
Date
2017-05-04  146.529999  931.659973  123.949997  81.639999
2017-05-05  148.960007  927.130005  123.510002  82.019997
2017-05-08  153.009995  934.299988  123.250000  82.889999
2017-05-09  153.990005  932.169983  123.209999  82.309998
2017-05-10  153.259995  928.780029  122.809998  81.910004
2017-05-11  153.949997  930.599976  123.199997  82.610001

In [18]:
volumes

                AAPL      JNJ       XOM
Date
2017-05-04  23371900  3748300  16164500
2017-05-05  27327700  3764800  10213000
2017-05-08  48752400  3608600   8097100
2017-05-09  39130400  3752000   8647100

In [19]:
type(prices)

pandas.core.frame.DataFrame

In [21]:
prices.dtypes

AAPL    float64
GOOG    float64
JNJ     float64
XOM     float64
dtype: object

### Create DataFrames

In [26]:
# dictionary
data = {'Name' : ['park','lee','kim'],
        'Company' : ['AAA','BBB','CCC'],
        'City' : ['Seoul','Seoul','Seoul']}

In [25]:
df = pd.DataFrame(data, columns = ['Name','Company','City'])
df

   Name Company   City
0  park     AAA  Seoul
1   lee     BBB  Seoul
2   kim     CCC  Seoul

In [27]:
df = pd.DataFrame.from_items([('Name', ['park','lee','kim']),
                              ('Company', ['AAA','BBB','CCC'])])
df

   Name Company
0  park     AAA
1   lee     BBB
2   kim     CCC

In [31]:
# numpy array
df = pd.DataFrame(np.array([[2,5],[3,6]]), index=list('ab'), columns=['ONE','TWO'])
df

   ONE  TWO
a    2    5
b    3    6

In [33]:
# dataframe 을 numpy array 로 변환
np.asarray(df)

array([[2, 5],
       [3, 6]])

### DataFrames, Series, Panels

In [34]:
prices*volumes

                    AAPL  GOOG           JNJ           XOM
Date
2017-05-04  3.424684e+09   NaN  4.646018e+08  1.319670e+09
2017-05-05  4.070734e+09   NaN  4.649905e+08  8.376702e+08
2017-05-08  7.459604e+09   NaN  4.447600e+08  6.711686e+08
2017-05-09  6.025690e+09   NaN  4.622839e+08  7.117428e+08
2017-05-10           NaN   NaN           NaN           NaN
2017-05-11           NaN   NaN           NaN           NaN

In [35]:
pd.set_option('display.float_format', lambda x: '{:,.1f}'.format(x))   # formatting
(prices*volumes).replace('nan', '-')    # replacing NaN

                      AAPL GOOG           JNJ             XOM
Date
2017-05-04 3,424,684,483.6    - 464,601,773.8 1,319,669,763.8
2017-05-05 4,070,734,383.3    - 464,990,455.5   837,670,229.4
2017-05-08 7,459,604,480.2    - 444,759,950.0   671,168,610.9
2017-05-09 6,025,690,491.7    - 462,283,916.2   711,742,783.7
2017-05-10               -    -             -               -
2017-05-11               -    -             -               -

In [36]:
vwap = (prices*volumes).sum()/volumes.sum()
vwap.dropna()

AAPL   151.4
JNJ    123.5
XOM     82.1
dtype: float64

## Indexing - loc(item based)

In [38]:
prices.loc['2017-05-04':'2017-05-08',['AAPL', 'GOOG']]

            AAPL  GOOG
Date
2017-05-04 146.5 931.7
2017-05-05 149.0 927.1
2017-05-08 153.0 934.3

In [39]:
prices[['AAPL', 'GOOG']]

            AAPL  GOOG
Date
2017-05-04 146.5 931.7
2017-05-05 149.0 927.1
2017-05-08 153.0 934.3
2017-05-09 154.0 932.2
2017-05-10 153.3 928.8
2017-05-11 153.9 930.6

## Indexing - iloc(index based)

In [40]:
prices.iloc[1:5,[0, 1]]

            AAPL  GOOG
Date
2017-05-05 149.0 927.1
2017-05-08 153.0 934.3
2017-05-09 154.0 932.2
2017-05-10 153.3 928.8

## Indexing - ix(mixed - loc > iloc)

In [43]:
# Position-based Indexing 
prices.ix[1:4,0:2]

            AAPL  GOOG
Date
2017-05-05 149.0 927.1
2017-05-08 153.0 934.3
2017-05-09 154.0 932.2

In [44]:
# Label-based Indexing on index (rows)
prices.ix[:'2017-05-09']

            AAPL  GOOG   JNJ  XOM
Date
2017-05-04 146.5 931.7 123.9 81.6
2017-05-05 149.0 927.1 123.5 82.0
2017-05-08 153.0 934.3 123.2 82.9
2017-05-09 154.0 932.2 123.2 82.3

In [45]:
# Duplicated values on columns
prices.ix[:,[2,2,1]]

             JNJ   JNJ  GOOG
Date
2017-05-04 123.9 123.9 931.7
2017-05-05 123.5 123.5 927.1
2017-05-08 123.2 123.2 934.3
2017-05-09 123.2 123.2 932.2
2017-05-10 122.8 122.8 928.8
2017-05-11 123.2 123.2 930.6

In [46]:
# One value every two rows
prices.ix[::2]

            AAPL  GOOG   JNJ  XOM
Date
2017-05-04 146.5 931.7 123.9 81.6
2017-05-08 153.0 934.3 123.2 82.9
2017-05-10 153.3 928.8 122.8 81.9

In [47]:
# Reverse rows
prices.ix[::-1]

            AAPL  GOOG   JNJ  XOM
Date
2017-05-11 153.9 930.6 123.2 82.6
2017-05-10 153.3 928.8 122.8 81.9
2017-05-09 154.0 932.2 123.2 82.3
2017-05-08 153.0 934.3 123.2 82.9
2017-05-05 149.0 927.1 123.5 82.0
2017-05-04 146.5 931.7 123.9 81.6

In [49]:
# Boolean indexing on index
prices.ix[prices['AAPL'] > 153]

            AAPL  GOOG   JNJ  XOM
Date
2017-05-08 153.0 934.3 123.2 82.9
2017-05-09 154.0 932.2 123.2 82.3
2017-05-10 153.3 928.8 122.8 81.9
2017-05-11 153.9 930.6 123.2 82.6

In [50]:
# Boolean indexing on columns
prices.ix[:,[len(c)<4 for c in prices.columns]]

             JNJ  XOM
Date
2017-05-04 123.9 81.6
2017-05-05 123.5 82.0
2017-05-08 123.2 82.9
2017-05-09 123.2 82.3
2017-05-10 122.8 81.9
2017-05-11 123.2 82.6

## Basic Operations

In [51]:
data = np.array([[2,5,8,11],[3,6,9,12]])
d1 = pd.DataFrame(data.T, index=list('abce'), columns=['K','W'])
d1

    K   W
a   2   3
b   5   6
c   8   9
e  11  12

In [53]:
# reindex, reorder
pd.DataFrame(d1, index=list('baez'), columns=['W','K','T'])

     W    K   T
b  6.0  5.0 nan
a  3.0  2.0 nan
e 12.0 11.0 nan
z  nan  nan nan

In [54]:
# new column
d1['Z'] = d1['W']-d1['K']
d1['B'] = d1['W']>4
d1

    K   W  Z      B
a   2   3  1  False
b   5   6  1   True
c   8   9  1   True
e  11  12  1   True

In [55]:
d1['SUM'] = d1.sum(axis=1)
d1

    K   W  Z      B  SUM
a   2   3  1  False  6.0
b   5   6  1   True 13.0
c   8   9  1   True 19.0
e  11  12  1   True 25.0

In [56]:
# Deleting rows 
d1.drop(['b', 'c'], axis=0)

    K   W  Z      B  SUM
a   2   3  1  False  6.0
e  11  12  1   True 25.0

In [58]:
# Deleting columns
d1.drop(['Z', 'B'], axis=1)

    K   W  SUM
a   2   3  6.0
b   5   6 13.0
c   8   9 19.0
e  11  12 25.0

In [59]:
# Inserting colums in a specific position
d2 = d1.copy()  # .copy() method is needed to create a new object.
d2.insert(1, 'Exp(W)', np.exp(d1['W']))
d2

    K    Exp(W)   W  Z      B  SUM
a   2      20.1   3  1  False  6.0
b   5     403.4   6  1   True 13.0
c   8   8,103.1   9  1   True 19.0
e  11 162,754.8  12  1   True 25.0

In [62]:
d1['part'] = d1['K'].ix[:2]
#d1['part'] = d1['part'].fillna(method='ffill')
d1

    K   W  Z      B  SUM  part
a   2   3  1  False  6.0   2.0
b   5   6  1   True 13.0   5.0
c   8   9  1   True 19.0   nan
e  11  12  1   True 25.0   nan

In [63]:
d1['part'] = d1['K'].ix[:2]
d1['part'] = d1['part'].fillna(method='ffill')
d1

    K   W  Z      B  SUM  part
a   2   3  1  False  6.0   2.0
b   5   6  1   True 13.0   5.0
c   8   9  1   True 19.0   5.0
e  11  12  1   True 25.0   5.0

In [65]:
d1['K'].isin([3, 8])

a    False
b    False
c     True
e    False
Name: K, dtype: bool

In [66]:
# rename column
d1.rename(columns={'K':'ONE','W':'TWO','Z':'THREE'})

   ONE  TWO  THREE      B  SUM  part
a    2    3      1  False  6.0   2.0
b    5    6      1   True 13.0   5.0
c    8    9      1   True 19.0   5.0
e   11   12      1   True 25.0   5.0

In [69]:
# rename all column
d2 = d1.copy()
d2.columns = ['1','2','3','4','5','6']
d2

    1   2  3      4    5   6
a   2   3  1  False  6.0 2.0
b   5   6  1   True 13.0 5.0
c   8   9  1   True 19.0 5.0
e  11  12  1   True 25.0 5.0

In [70]:
# iteration
for row_index, row in d1.iterrows():
    print(row_index, '**', ' - '.join([str(item) for item in row]))

a ** 2 - 3 - 1 - False - 6.0 - 2.0
b ** 5 - 6 - 1 - True - 13.0 - 5.0
c ** 8 - 9 - 1 - True - 19.0 - 5.0
e ** 11 - 12 - 1 - True - 25.0 - 5.0

In [71]:
for t in d1.itertuples():
    print(t)

Pandas(Index='a', K=2, W=3, Z=1, B=False, SUM=6.0, part=2.0)
Pandas(Index='b', K=5, W=6, Z=1, B=True, SUM=13.0, part=5.0)
Pandas(Index='c', K=8, W=9, Z=1, B=True, SUM=19.0, part=5.0)
Pandas(Index='e', K=11, W=12, Z=1, B=True, SUM=25.0, part=5.0)

## Duplicated Data

In [72]:
d3 = pd.read_csv('temp/p01_d2.csv', index_col=0)
d3

       a  b    c
0    one  x  0.3
1    one  y -0.7
2    two  y -0.3
3  three  x  0.0
4    two  y  0.5

In [73]:
d3['a dup'] = d3.duplicated(['a'])
d3['a+b dup'] = d3.duplicated(['a', 'b'])
d3['a+b dup - take last'] = d3.duplicated(['a', 'b'], keep='last')
d3

       a  b    c  a dup a+b dup a+b dup - take last
0    one  x  0.3  False   False               False
1    one  y -0.7   True   False               False
2    two  y -0.3  False   False                True
3  three  x  0.0  False   False               False
4    two  y  0.5   True    True               False

In [74]:
# Remove Duplicates
d3.drop_duplicates(['a', 'b'],keep='last')

       a  b    c  a dup a+b dup a+b dup - take last
0    one  x  0.3  False   False               False
1    one  y -0.7   True   False               False
3  three  x  0.0  False   False               False
4    two  y  0.5   True    True               False

## Working with Large Arrays

In [82]:
# memory 공간

rows, cols = 100, 100
np_array = np.array(np.random.randn(rows, cols), dtype=np.float64)
d4 = pd.DataFrame(np_array)
print ('Rows x Cols x 8:                     ', rows*cols*8)
print ('np Array Memory Occupation:          ', np_array.nbytes)
print ('Dataframe Values Memory Occupation:  ', d4.values.nbytes)
print ('Dataframe Index Memory Occupation:   ', d4.index.nbytes)
print ('Dataframe Columns Memory Occupation: ', d4.columns.nbytes)

Rows x Cols x 8:                      80000
np Array Memory Occupation:           80000
Dataframe Values Memory Occupation:   80000
Dataframe Index Memory Occupation:    80
Dataframe Columns Memory Occupation:  80

In [83]:
d4 = d4.astype(dtype=np.float16)
print ('Dataframe Values Memory Occupation:  ', d4.values.nbytes)

Dataframe Values Memory Occupation:   20000

In [87]:
d4.columns

RangeIndex(start=0, stop=100, step=1)

###  Explore large arrays

In [88]:
d3 = pd.read_csv('example_data/p01_d3.csv.gz', compression='gzip')

In [89]:
for col in d3.columns:         
    print (col, end=' - ')

Istat - Comune - Provincia - Regione - Prefisso - CAP - CodFisco - Abitanti - Link -

In [90]:
d3.head()

,Istat,Comune,Provincia,Regione,Prefisso,CAP,CodFisco,Abitanti,Link
0,28001,Abano Terme,PD,VEN,49,35031,A001,19726,http://www.comuni-italiani.it/028/001/
1,98001,Abbadia Cerreto,LO,LOM,371,26834,A004,293,http://www.comuni-italiani.it/098/001/
2,97001,Abbadia Lariana,LC,LOM,341,23821,A005,3305,http://www.comuni-italiani.it/097/001/
3,52001,Abbadia San Salvatore,SI,TOS,577,53021,A006,6722,http://www.comuni-italiani.it/052/001/
4,95001,Abbasanta,OR,SAR,785,09071,A007,2872,http://www.comuni-italiani.it/095/001/

In [91]:
d3[d3.columns[:3]].head()

   Istat                 Comune Provincia
0  28001            Abano Terme        PD
1  98001        Abbadia Cerreto        LO
2  97001        Abbadia Lariana        LC
3  52001  Abbadia San Salvatore        SI
4  95001              Abbasanta        OR

In [92]:
d3[d3.columns[-4:-1]].tail()

        CAP CodFisco  Abitanti
8087  33020     M200       607
8088  13848     M201      1152
8089  87040     M202      2413
8090  83030     M203      1232
8091  89867     M204      2055

In [93]:
d3.ix[1000:1010, :7]

       Istat            Comune Provincia Regione  Prefisso    CAP CodFisco
1000    1043            Busano        TO     PIE       124  10080     B284
1001    4034             Busca        CN     PIE       171  12022     B285
1002   15038           Buscate        MI     LOM       331  20010     B286
1003   89004           Buscemi        SR     SIC       931  96010     B287
1004   81002  Buseto Palizzolo        TP     SIC       923  91012     B288
1005  108051           Busnago        MB     LOM        39  20874     B289
1006   15040           Bussero        MI     LOM         2  20060     B292
1007   34007           Busseto        PR     EMR       524  43011     B293
1008   68005  Bussi sul Tirino        PE     ABR        85  65022     B294
1009   70005             Busso        CB     MOL       874  86010     B295
1010   23015        Bussolengo        VR     VEN        45  37012     B296

In [94]:
d3.ix[:, 'Abitanti'].describe()

count       8,092.0
mean        7,492.1
std        41,510.3
min            34.0
25%         1,041.0
50%         2,468.0
75%         6,185.2
max     2,761,477.0
Name: Abitanti, dtype: float64

##  Reindex

In [101]:
data = np.array([[3, 5, 7, 10, 13, 16, 56, 72],
                 [8, 16, 28, 37, 45, 57, 69, 90],
                 [3, 6, NaN, NaN, 15, 18, NaN, NaN],
                 [1, 2, 4, 7, 11, 16, 65, 88],
                 [NaN, NaN, NaN, NaN, 16, 19, 82, 91]])
d4 = pd.DataFrame(data.T, columns=['one', 'two', 'three', 'four', 'five'])
d4

   one  two  three  four  five
0  3.0  8.0    3.0   1.0   nan
1  5.0 16.0    6.0   2.0   nan
2  7.0 28.0    nan   4.0   nan
3 10.0 37.0    nan   7.0   nan
4 13.0 45.0   15.0  11.0  16.0
5 16.0 57.0   18.0  16.0  19.0
6 56.0 69.0    nan  65.0  82.0
7 72.0 90.0    nan  88.0  91.0

In [102]:
d5 = d4.reindex(columns=['one','three','five','two','four'])
d5

   one  three  five  two  four
0  3.0    3.0   nan  8.0   1.0
1  5.0    6.0   nan 16.0   2.0
2  7.0    nan   nan 28.0   4.0
3 10.0    nan   nan 37.0   7.0
4 13.0   15.0  16.0 45.0  11.0
5 16.0   18.0  19.0 57.0  16.0
6 56.0    nan  82.0 69.0  65.0
7 72.0    nan  91.0 90.0  88.0

In [103]:
d4

   one  two  three  four  five
0  3.0  8.0    3.0   1.0   nan
1  5.0 16.0    6.0   2.0   nan
2  7.0 28.0    nan   4.0   nan
3 10.0 37.0    nan   7.0   nan
4 13.0 45.0   15.0  11.0  16.0
5 16.0 57.0   18.0  16.0  19.0
6 56.0 69.0    nan  65.0  82.0
7 72.0 90.0    nan  88.0  91.0

## Multi Index

In [107]:
d6 = pd.read_csv('temp/p01_d4.csv', index_col=['Country',
                                               'Number',
                                               'Dir'])
d6

                      0    1    2
Country Number Dir
Fra     one    x   -1.6  0.9 -0.5
        two    y   -1.5 -0.2 -0.8
               z   -0.8 -0.3  0.8
Ger     one    x    0.6 -1.5 -0.8
Jap     one    x    0.1  0.3 -0.3
        two    x   -0.5  0.7 -0.1
USA     one    y   -0.8 -1.2 -1.4
               z    0.8  1.3 -2.1

In [108]:
d6.ix['Fra']

              0    1    2
Number Dir
one    x   -1.6  0.9 -0.5
two    y   -1.5 -0.2 -0.8
       z   -0.8 -0.3  0.8

In [109]:
d6.ix['Fra', 'two']

       0    1    2
Dir
y   -1.5 -0.2 -0.8
z   -0.8 -0.3  0.8

In [110]:
d6.ix['Fra':'Ger']

                      0    1    2
Country Number Dir
Fra     one    x   -1.6  0.9 -0.5
        two    y   -1.5 -0.2 -0.8
               z   -0.8 -0.3  0.8
Ger     one    x    0.6 -1.5 -0.8

In [111]:
d6.reorder_levels([2,1,0], axis=0).sortlevel(0)

                      0    1    2
Dir Number Country
x   one    Fra     -1.6  0.9 -0.5
           Ger      0.6 -1.5 -0.8
           Jap      0.1  0.3 -0.3
    two    Jap     -0.5  0.7 -0.1
y   one    USA     -0.8 -1.2 -1.4
    two    Fra     -1.5 -0.2 -0.8
z   one    USA      0.8  1.3 -2.1
    two    Fra     -0.8 -0.3  0.8

In [112]:
d6.reset_index(level=1)

            Number    0    1    2
Country Dir
Fra     x      one -1.6  0.9 -0.5
        y      two -1.5 -0.2 -0.8
        z      two -0.8 -0.3  0.8
Ger     x      one  0.6 -1.5 -0.8
Jap     x      one  0.1  0.3 -0.3
        x      two -0.5  0.7 -0.1
USA     y      one -0.8 -1.2 -1.4
        z      one  0.8  1.3 -2.1

##  Package Options

In [114]:
pd.set_option('display.max_rows', 10)
pd.get_option('display.max_rows')

10

In [115]:
pd.reset_option('display.max_rows')
pd.get_option('display.max_rows')

60

In [116]:
pd.describe_option('display.chop_threshold')
pd.describe_option('display.colheader_justify')
pd.describe_option('display.column_space')
pd.describe_option('display.date_dayfirst')
pd.describe_option('display.date_yearfirst')
pd.describe_option('display.encoding')
pd.describe_option('display.expand_frame_repr')
pd.describe_option('display.float_format')
pd.describe_option('display.max_columns')
pd.describe_option('display.max_colwidth')
pd.describe_option('display.max_rows')
pd.describe_option('display.notebook_repr_html')
pd.describe_option('display.precision')

display.chop_threshold : float or None
    if set to a float value, all float values smaller then the given threshold
    will be displayed as exactly 0 by repr and friends.
    [default: None] [currently: None]


display.colheader_justify : 'left'/'right'
    Controls the justification of column headers. used by DataFrameFormatter.
    [default: right] [currently: right]


display.column_space No description available.
    [default: 12] [currently: 12]


display.date_dayfirst : boolean
    When True, prints and parses dates with the day first, eg 20/01/2005
    [default: False] [currently: False]


display.date_yearfirst : boolean
    When True, prints and parses dates with the year first, eg 2005/01/20
    [default: False] [currently: False]


display.encoding : str/unicode
    Defaults to the detected encoding of the console.
    Specifies the encoding to be used for strings returned by to_string,
    these are generally strings meant to be displayed on the console.
    [default: UTF-8] [currently: UTF-8]


display.expand_frame_repr : boolean
    Whether to print out the full DataFrame repr for wide DataFrames across
    multiple lines, `max_columns` is still respected, but the output will
    wrap-around across multiple "pages" if its width exceeds `display.width`.
    [default: True] [currently: True]


display.float_format : callable
    The callable should accept a floating point number and return
    a string with the desired format of the number. This is used
    in some places like SeriesFormatter.
    See formats.format.EngFormatter for an example.
    [default: None] [currently: <function <lambda> at 0x000001F575232620>]


display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 20] [currently: 20]


display.max_colwidth : int
    The maximum width in characters of a column in the repr of
    a pandas data structure. When the column overflows, a "..."
    placeholder is embedded in the output.
    [default: 50] [currently: 50]


display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 60]


display.notebook_repr_html : boolean
    When True, IPython notebook will use html representation for
    pandas objects (if it is available).
    [default: True] [currently: True]


display.precision : int
    Floating point output precision (number of significant digits). This is
    only a suggestion
    [default: 6] [currently: 6]